# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [10]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [12]:
frame = pd.concat([s1,s2,s3], axis=1)
frame.head()

   0  1      2
0  1  3  27625
1  3  2  25249
2  4  3  19613
3  1  2  22104
4  4  2  27263

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [15]:
frame.columns = ["bedrs", "bathrs", "price_sqr_meter"]
#frame.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
frame.head()

   bedrs  bathrs  price_sqr_meter
0      1       3            27625
1      3       2            25249
2      4       3            19613
3      1       2            22104
4      4       2            27263

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [25]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)
bigcolumn = bigcolumn.to_frame()

### Step 6. Ops it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [ ]:
bigcolumn.reset_index()